Table of Contents
 Enum WeldType
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Represents the code of the position
public enum WeldType
Fields
Bevel = 4
Bevel weld
DoubleFillet = 3
Fillet weld on both sides (double fillet)
LeftFillet = 1
Fillet weld is on the left side
None = 0
No weld
RightFillet = 2
Fillet weld on the right side
Fields
 Name |  Description
 Bevel = 4
Bevel weld
 DoubleFillet = 3
Fillet weld on both sides (double fillet)
 LeftFillet = 1
Fillet weld is on the left side
 None = 0
No weld
 RightFillet = 2
Fillet weld on the right side
 Edit this page